# ReplaceIFCWithMap

## Description
Replaces the existing IFC Data record with info from IFC Data Mapping.

```pascal
FUNCTION ReplaceIFCWithMap(
				hObject      : HANDLE;
				inStrObjName : STRING) : BOOLEAN;
```

```python

def vs.ReplaceIFCWithMap(hObject, inStrObjName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||
|inStrObjName|STRING||

## Version
Availability: from Vectorworks 2017
## Category
* IFC